import { AvatarYuraSeo } from "@assets/images";

export const testimonials: Testimonial.VO[] = [
  {
    name: "서유라",
    jobTitle: "프로덕트(UX/UI) 디자이너",
    avatar: AvatarYuraSeo,
    company: "더에이아이랩",
    link: "https://www.linkedin.com/in/yullo/",
    text: `저는 TheAILab에서 하정원님과 긴밀하게 협업한 프로덕트팀 리더였으며, 기회가 된다면 다시 함께하고 싶은 사람으로서 정원님을 적극 추천드립니다.

  정원님은 처음 입사했을때부터 빠르게 회사의 업무를 습득하고 개발적인 부분에 대해서도 의견 제시를 하며 금방 실무자로서 기여를 했습니다. 버그나 에러 등의 문제가 터졌을때도 이슈를 빠르게 파악하고 해결해 나갔고 개발자로서 항상 더 좋은 방식을 시도하는 것에 흥미를 가지며, 뿐만 아니라 회사를 위해 가장 효율적인 방법을 선택해 상황에 맞게 다각도로 문제를 원만히 해결해나가는 동료였습니다. 디자인 캐치 능력도 좋아서 요청사항에 따라 곧 잘 만들어내었고 항상 주어진 일을 그대로 해내는 것이 아니라 주체적으로 더 나은 퀄리티의 작업물을 만들기위해 노력했습니다.
  
  그리고 의사결정을 할 때 매번 논의 후 결정을 하는 모습이 인상적이었습니다. 타인의 의견을 수용하고 자신의 의견을 어필하는 것에 대한 소통의 균형을 갖추고 있어 웬만한 경력 개발자들보다도 커뮤니케이션 능력이 뛰어나다고 보았습니다. 더불어 항상 밝고 긍정적인 에너지로 회사의 분위기를 좋게 만들어줘 함께 일하는 동안 저도 좋은 영향력을 많이 받았습니다.
  
  이런 다양한 부분에서 저는 정원님이 정말 연차에 비해 좋은 퍼포먼스와 센스를 갖췄다는 생각이 들었습니다. 그리고 점심시간이면 온라인클래스를 듣거나, 아티클을 살펴보며 추가적으로 개발공부를 틈틈이 하는 등 대단한 열정을 보여 빠른 성장이 기대되는 동료였습니다. 그러므로 저는 정원님을 자신있게 적극 추천드립니다.`,
  },
  {
    name: "김민수",
    jobTitle: "프론트엔드 개발자",
    avatar: "https://github.com/minsoo-web.png",
    company: "빅픽처팀",
    link: "https://github.com/minsoo-web",
    text: `하정원님은 내일의 성장이 기대되는 개발자입니다.

    개발자가 지녀야 할 가장 중요한 태도 중에 하나가 성장욕구라고 생각합니다.
    개발자로서의 전문성을 키워나가기 위한 지식 욕구가 누구보다 강한 사람이며, 현실에 안주하지 않고 새로운 기술 습득에 대한 욕구가 강한 사람입니다.
    이에 묻히지 않는 실력으로 자신의 기술을 확장해 나갑니다.
    내일이 기대되는 개발자와 일하고 싶다면, 하정원님을 추천합니다.
    
    하정원님은 꼼꼼한 개발자입니다.
    
    이건 이래서 그래요. 하고 가이드를 해주면 정원님은 왜 그런지를 더 자세히 찾아보고 그 이유를 납득 할 때까지 찾아봅니다.
    한 번은 정원님에게 코드리뷰로 conversation을 한 적이 있는데, 정원님이 공식문서와 stackoverflow 링크를 들고와서 그 코드에 대한 이유와 예상 효과에 대해서 친절히 설명해주신 기억이 납니다.
    단순히 기능 구현에 급급한 개발자가 아닌, 꼼꼼함과 완성도 있는 코드를 만나보고 싶다면 하정원님과 일하는 것을 추천합니다.
    
    하정원님은 믿음을 주는 개발자입니다.
    
    정원님에게 맡기는 일이라면, 어떤 일이든 완벽히 해낼 것을 기대하게 해주는 개발자입니다.
    제가 80을 기대하고 정원님에게 일을 맡긴다면, 정원님은 100을 넘어서 150, 200프로의 일을 해내주는 개발자입니다.
    믿음을 주는 개발자와 일하고 싶다면, 하정원님을 추천합니다.
    
    하정원님은 웃음을 주는 개발자입니다.
    
    하정원님은 실력에 묻히지 않는 커뮤니케이션 능력으로 팀원들과 소통합니다.
    채팅을 통해서 온라인으로 해결할 수 있는 간단한 문제와, 직접 구두로 나눠서 소통해야하는 내용을 구분하여 소통하는 것과
    다른 파트의 비개발자분들과의 의견 대립도 정원님 특유의 의사소통 능력으로 원활하게 해결하는 것이
    정원님의 커뮤니케이션 능력이라고 생각합니다.
    
    웃음으로 가득한, 내일이 기대되는, 꼼꼼하고 신뢰가 가는 개발자 하정원님과 일하는 것을 추천합니다.`,
  },
  {
    name: "박찬혁",
    jobTitle: "프론트엔드 개발자",
    avatar: "https://github.com/ChanhyukPark-Tech.png",
    company: "에이플러스비",
    link: "https://github.com/ChanhyukPark-Tech",
    text: `하정원 님은 시켜서 하는 개발자가 아닌, 해야 하는 일을 발굴하는 개발자입니다.

    정원 님이랑 프론트엔드 협업을 많이 진행했을 때 개발자로서 편안함을 느꼈습니다. "정원님 이 컴포넌트 구현 부탁드려요"라고 요청을 드리면, 컴포넌트 구현은 당연히 완벽하게 구현 뒤, 그 컴포넌트를 확인할 수 있는 시스템까지 구축하는 개발자였습니다. "요구사항"만 만족시키고 끝이 아닌, 더 좋게 더 효율적으로 협업할 수 있는 방향을 아는 개발자입니다.
    
    정원님은 소통을 "좋아"하고, "잘"하고 왜 해야 하는지 알고 있는 개발자입니다.
    해결해야 할 문제가 있을 때 고군분투하는 것이 아닌, 반드시 담당자에게 찾아가서 미소와 함께 소통하는 soft skill을 겸비하고 있습니다. 이로써 업무의 병목이 없고, 더 나는 프로덕트를 탄생시킬 줄 아는 개발자입니다.
    
    정원님은 "물음"을 표출할 줄 아는 개발자입니다. 이미 굳어있던 사내의 컨벤션, 문화에 "왜요?", "이것이 좋나요?"라고 자신 있게 말하며 근거와 래퍼런스를 항상 준비하여 자신의 의견을 표출하는 개발자입니다.
    
    정원님 고마웠고, 세계를 무대로 다시 만납시다!`,
  },
  {
    name: "김동규",
    jobTitle: "프론트엔드 개발자",
    avatar: "https://github.com/po4tion.png",
    company: "빅픽처팀",
    link: "https://github.com/po4tion",
    text: `하정원님을 추천합니다.`,
  },
];
